/* Localized versions of strings used in the GraphFoundation UI */

GraphMenu_AddNote = "Add Note";
GraphMenu_AddSubgraph = "Create Subgraph";
GraphMenu_CreateSubgraph = "Create Subgraph with Selection";
GraphMenu_EditParent = "Edit Parent Graph...";
GraphMenu_ZoomToFit = "Zoom To All Patches";
GraphMenu_FitSelection = "Zoom To Selected Patches";

PasteboardFailure_Title = "Incomplete restoration";
PasteboardFailure_Message = "State was not successfully restored from the pasteboard.";
PasteboardFailure_Button = "Continue";

NodeMenu_EditSubgraph = "Edit Subgraph...";
NodeMenu_PublishedInputs = "Publish Inputs";
NodeMenu_PublishedOutputs = "Publish Outputs";
NodeMenu_SelectDownstream = "Select Downstream Patches";
NodeMenu_SelectUpstream = "Select Upstream Patches";
NodeMenu_DeselectDownstream = "Deselect Downstream Patches";
NodeMenu_DeselectUpstream = "Deselect Upstream Patches";

Tooltip_Name = "Name";
Tooltip_Class = "Class";

Inspector_Title = "Information";

Path_RootGraphName = "Root %@";

Browser_RootGraphName = "Root %@";

NoteMenu_Edit = "Edit...";
NoteMenu_SetColor = "Set Color";
NoteMenu_Delete = "Delete";
NoteMenu_Color_Yellow = "Yellow";
NoteMenu_Color_Green = "Green";
NoteMenu_Color_Red = "Red";
NoteMenu_Color_Blue = "Blue";
NoteMenu_Color_Gray = "Gray";

Note_Default = "Empty note (double-click to edit)";
